In [1]:
print("HW")

HW

In [14]:
print("Pandas Tutorial")

Pandas Tutorial

In [17]:
print("Create a new DF in pandas")
import pandas as pd
 
# initialize list of lists
data = [['Time1', 10], ['Time1', 15], ['Time1', 14]]
# Create the pandas DataFrame
df = pd.DataFrame(data, columns = ['Name', 'Age'])
# print dataframe.
df



# initialise data of lists.
data = {'Time':['Time1', 'Time2', 'Time3', 'Time4'],
        'Open':[20, 21, 19, 18],
        'High':[20, 21, 19, 18],
        'Low':[20, 21, 19, 18],
        'Close':[20, 21, 19, 18],
       }
# Create DataFrame
df = pd.DataFrame(data)
# Print the output.
df

Create a new DF in pandas

    Time  Open  High  Low  Close
0  Time1    20    20   20     20
1  Time2    21    21   21     21
2  Time3    19    19   19     19
3  Time4    18    18   18     18

In [8]:
print("Add a new column to the DF")
df["NEW_COLUMN"] = df["Age"]
df["NEW_COLUMN2"] = 0
df

Add a new column to the DF

    Name  Age  NEW_COLUMN  NEW_COLUMN2
0    Tom   20          20            0
1   nick   21          21            0
2  krish   19          19            0
3   jack   18          18            0

In [10]:
print("Add a new column based on other columns")
df["NEW_COLUMN"] = df["Age"]
df
df["A"]=df["Age"]
df["B"]=df["Age"]

Add a new column based on other columns

In [12]:
print("Add a new column values of which are based on previous rows or columns")
df['C'] = df['A'] + df['B']
df['sum'] = df[list(df.columns)].sum(axis=1)
df['C'] = df.apply(lambda row: row['A'] + row['B'], axis=1)
df['z']=df.iloc[:,1:].sum(1)
df

Add a new column values of which are based on previous rows or columns

    Name  Age  NEW_COLUMN  NEW_COLUMN2   A   B   C  sum    z
0    Tom   20          20            0  20  20  40  480  840
1   nick   21          21            0  21  21  42  504  882
2  krish   19          19            0  19  19  38  456  798
3   jack   18          18            0  18  18  36  432  756

In [13]:
print("Filter a DF")
rslt_df = dataframe[dataframe['Percentage'] > 70] 
rslt_df = dataframe.loc[dataframe['Percentage'] > 70] 
options = ['Science', 'Commerce'] 
    
# selecting rows based on condition 
rslt_df = dataframe[dataframe['Stream'].isin(options)] 


options = ['Commerce' ,'Science'] 
    
# selecting rows based on condition 
rslt_df = dataframe[(dataframe['Age'] == 22) & 
          dataframe['Stream'].isin(options)]

Filter a DF